function distinct(a) {
  const arr = [];
  for (let i of a) {
    !arr.includes(i) ? arr.push(i) : arr;
  }
  return arr;
}
console.log(distinct([1, 1, 2])); //[1, 2]
console.log(distinct([1, 2, 1, 1, 3, 2])); // [1, 2, 3]

function distinct2(a) {
  return [...new Set(a)];
}

// new Set(a) создает новый объект Set на основе массива a.
// [...new Set(a)] используется для преобразования объекта Set обратно в массив. Оператор распространения (...) применяется к объекту Set, чтобы преобразовать его содержимое в массив.
// Возвращаемый массив содержит только уникальные элементы, потому что объект Set автоматически удаляет повторяющиеся значения при создании.
